[
  {
    "id": 1,
    "title": "Lorem",
    "date": "2013-04-09",
    "body": "A work in progress. [This is the beginning of an experimental plugin](http:\/\/tbaldw.in\/lorem) which takes a block of text and transforms it into a collection of nodes representing each word in the block. The user can then apply effects to the words: blacking them out (à la \"newspaper blackout poetry\") or animating them into place.\n\nThis example randomly selects words from quotations of famous works of literature with the goal of creating accidental poetry.\n\nSee it in action at [http:\/\/tbaldw.in\/lorem](http:\/\/tbaldw.in\/lorem).",
    "image": "51670843c7775lorem.gif",
    "published": 0,
    "order": 9,
    "url": "/lorem"
  },
  {
    "id": 2,
    "title": "Copland",
    "date": "2013-04-09",
    "body": "This [little music-making experiment](http:\/\/tbaldw.in\/copland) encourages the user to create patterns by clicking boxes which represent different pre-determined pitches. The piano sounds of the grid on the left move 16x faster than the string sounds of the grid on the right. The string harmonies were selected to sound more-or-less consonant with the pitch palette of the piano grid. Clicking the colored box results in a shift to a new pitch palette for both grids.\n\nPressing the space-bar or the return key pause and play the loop. The backspace clears the grid. And pressing the letter 'e' causes the grid to start 'evolving' - adding and removing pitches strategically. The idea here is that the user can leave the application running in the background, enjoying the variety of patterns generated by the application's evolution algorithm.\n\nYou can leave Copland running in the background but it generally performs better when it has a window all to itself.\n\nUsers may also save their creations by pressing the letter 's'. This will pull up a URL which should load in the creation at the start.\n\nThe name \"Copland\" comes from the famous American composer Aaron Copland, whose Pulitzer prize-winning work, \"Appalachian Spring\" inspired the sound palette.\n\nThere are still a few little bugs and additions that need to be made. And reporting bugs is much appreciated!\n\nAlso: I only have mp3 files for the project right now - which means it won't work in Firefox. Try Chrome or Safari instead.\n\nSee it in action at [http:\/\/tbaldw.in\/copland](http:\/\/tbaldw.in\/copland)",
    "image": "copland.png",
    "published": 1,
    "order": 4,
    "url": "/copland"
  },
  {
    "id": 7,
    "title": "tbaldw.in",
    "date": "2013-04-09",
    "body": "It had been a few months since I put up my first site. I had done it in about a day using an HTML5 boilerplate and Twitter Bootstrap. After a few months, however, I felt I needed something different. I designed the look and movement of this new site, writing all of the HTML, CSS, and JavaScript. I used Backbone.js to organize the views, and I wrote an admin section (basically a CMS) which allows me to add\/edit projects in the work section in the Markdown language and upload images for the project blurbs. These are loaded in dynamically when accessing the Work section of the site, so I never have to write HTML or directly place files on the server.",
    "image": "516708270adf3tbaldw.in.jpg",
    "published": 1,
    "order": 6,
    "url": "https://github.com/rolyatmax/tbaldw.in-site"
  },
  {
    "id": 10,
    "title": "Viz",
    "date": "2013-04-19",
    "body": "Live version: [http:\/\/tbaldw.in\/viz](http:\/\/tbaldw.in\/viz)\n\nAn audio visualization experiment I made using WebAudio API and WebGL with Three.js.\n\nI like this piece of music for this experiment because I think the electronic and percussive sounds make for some very satisfying choreography.\n\nMusic by Jon Hopkins - \"Small Memory, Tunng Remix\"\n\nNote: this experiment must be viewed in [Chrome](http:\/\/google.com\/chrome).",
    "image": "viz.png",
    "published": 1,
    "order": 8,
    "url": "/viz"
  },
  {
    "id": 11,
    "title": "CircleTime",
    "date": "2013-09-26",
    "body": "This \"project\" has no real use whatsoever. It's kind of fun to play with, however. So I'm including it here.\n\nSee it in action at [http:\/\/tbaldw.in\/circletime](http:\/\/tbaldw.in\/circletime)",
    "image": "524495ba0ca8ccircletime.png",
    "published": 1,
    "order": 7,
    "url": "/circletime"
  },
  {
    "id": 12,
    "title": "Dots",
    "date": "2013-10-15",
    "body": "Here I use the canvas element to create a visualization inspired by the game Dots & Boxes and some art I saw at Dia:Beacon recently.\n\nIt's fun to adjust the controls to see what patterns are generated. Try it out [here](http:\/\/tbaldw.in\/dots).",
    "image": "525e117e8ae5cdots.png",
    "published": 1,
    "order": 5,
    "url": "/dots"
  },
  {
    "id": 13,
    "title": "CitiBike Summer",
    "date": "2013-10-18",
    "body": "I made [this visualization](http:\/\/tbaldw.in\/citibike) to show the use of CitiBike stations in Manhattan during the average summer week. The data was collected hourly during June & July 2013, and I wrote scripts in Python and in Node to pull the data out of Mongo and get it into shape.\n\nI used d3 for map projection, and I wrote the rest of the visualization using canvas. Check out the visualization [here](http:\/\/tbaldw.in\/citibike) and the source code [here](http:\/\/github.com\/rolyatmax\/citibike_data).",
    "image": "5261e4adbaafacitibike.png",
    "published": 1,
    "order": 1,
    "url": "/citibike"
  },
  {
    "id": 14,
    "title": "Q-Learning",
    "date": "2014-09-10",
    "body": "",
    "image": "tictactoe.png",
    "published": 1,
    "order": 3,
    "url": "/tictactoe"
  },
  {
    "id": 15,
    "title": "Maze Learning",
    "date": "2014-09-25",
    "body": "",
    "image": "maze.png",
    "published": 1,
    "order": 2,
    "url": "/maze"
  }
]
